## Plan Result (sds_dev_ado)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 0 to change, 10 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.aks_mi_apintegration_contributor[0]
  * azurerm_role_assignment.aks_mi_datasharelanding_contributor[0]
  * azurerm_role_assignment.mi_adhoc_contributor[0]
  * azurerm_role_assignment.mi_audit_contributor[0]
  * azurerm_role_assignment.mi_export_contributor[0]
  * azurerm_role_assignment.mi_landing_contributor[0]
  * azurerm_role_assignment.mi_pds_contributor[0]
  * azurerm_role_assignment.mi_polybasestaging_contributor[0]
  * azurerm_role_assignment.sops-kv-reader
  * azurerm_user_assigned_identity.azure-devops-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.aks_mi_apintegration_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "aks_mi_apintegration_contributor" {
      ~ id                               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/miapintegrationdev/providers/Microsoft.Authorization/roleAssignments/c57add5f-2a67-5009-24cd-08fc87bf8c00" -> (known after apply)
      ~ name                             = "c57add5f-2a67-5009-24cd-08fc87bf8c00" -> (known after apply)
      ~ principal_id                     = "713b89b4-5e9c-400a-a4fb-eaccb217b215" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.aks_mi_datasharelanding_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "aks_mi_datasharelanding_contributor" {
      ~ id                               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/midatasharelandingdev/providers/Microsoft.Authorization/roleAssignments/02621138-35c2-153f-bef1-09bc14109d77" -> (known after apply)
      ~ name                             = "02621138-35c2-153f-bef1-09bc14109d77" -> (known after apply)
      ~ principal_id                     = "713b89b4-5e9c-400a-a4fb-eaccb217b215" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.mi_adhoc_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "mi_adhoc_contributor" {
      ~ id                               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/miadhoclandingdev/providers/Microsoft.Authorization/roleAssignments/0060a1c2-3982-e9b0-c043-33293682b9d6" -> (known after apply)
      ~ name                             = "0060a1c2-3982-e9b0-c043-33293682b9d6" -> (known after apply)
      ~ principal_id                     = "713b89b4-5e9c-400a-a4fb-eaccb217b215" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.mi_audit_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "mi_audit_contributor" {
      ~ id                               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/miauditdev/providers/Microsoft.Authorization/roleAssignments/28a8c4d3-edde-7493-167a-3424f0fd9465" -> (known after apply)
      ~ name                             = "28a8c4d3-edde-7493-167a-3424f0fd9465" -> (known after apply)
      ~ principal_id                     = "713b89b4-5e9c-400a-a4fb-eaccb217b215" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.mi_export_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "mi_export_contributor" {
      ~ id                               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/miexportdev/providers/Microsoft.Authorization/roleAssignments/842e22a9-6c44-baf2-8491-adba1859f5ef" -> (known after apply)
      ~ name                             = "842e22a9-6c44-baf2-8491-adba1859f5ef" -> (known after apply)
      ~ principal_id                     = "713b89b4-5e9c-400a-a4fb-eaccb217b215" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.mi_landing_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "mi_landing_contributor" {
      ~ id                               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/milandingdev/providers/Microsoft.Authorization/roleAssignments/2cc66ef2-b220-b9c9-f3b6-ae70b50124fb" -> (known after apply)
      ~ name                             = "2cc66ef2-b220-b9c9-f3b6-ae70b50124fb" -> (known after apply)
      ~ principal_id                     = "713b89b4-5e9c-400a-a4fb-eaccb217b215" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.mi_pds_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "mi_pds_contributor" {
      ~ id                               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/mipersistentdev/providers/Microsoft.Authorization/roleAssignments/9f2a4f92-424e-4547-5210-cf01b8c8e7f5" -> (known after apply)
      ~ name                             = "9f2a4f92-424e-4547-5210-cf01b8c8e7f5" -> (known after apply)
      ~ principal_id                     = "713b89b4-5e9c-400a-a4fb-eaccb217b215" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.mi_polybasestaging_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "mi_polybasestaging_contributor" {
      ~ id                               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/mipolybasestagingdev/providers/Microsoft.Authorization/roleAssignments/22d64b1a-ebbc-7ef0-742e-3579996310c8" -> (known after apply)
      ~ name                             = "22d64b1a-ebbc-7ef0-742e-3579996310c8" -> (known after apply)
      ~ principal_id                     = "713b89b4-5e9c-400a-a4fb-eaccb217b215" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.sops-kv-reader must be replaced
-/+ resource "azurerm_role_assignment" "sops-kv-reader" {
      ~ id                               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dtssharedservicesdevkv/providers/Microsoft.Authorization/roleAssignments/413f9d06-30d4-260b-d141-80295839502e" -> (known after apply)
      ~ name                             = "413f9d06-30d4-260b-d141-80295839502e" -> (known after apply)
      ~ principal_id                     = "713b89b4-5e9c-400a-a4fb-eaccb217b215" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.azure-devops-mi must be replaced
-/+ resource "azurerm_user_assigned_identity" "azure-devops-mi" {
      ~ client_id           = "768f5000-d72b-492e-be7a-31bd0370d291" -> (known after apply)
      ~ id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/managed-identities-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azure-devops-dev-mi" -> (known after apply)
      ~ name                = "azure-devops-dev-mi" -> "azure-devops-stg-mi" # forces replacement
      ~ principal_id        = "713b89b4-5e9c-400a-a4fb-eaccb217b215" -> (known after apply)
      ~ resource_group_name = "managed-identities-dev-rg" -> "managed-identities-stg-rg" # forces replacement
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/ado-shared-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
            "startupMode"  = "always"
        }
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 10 to add, 0 to change, 10 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":6,"Program":"tfcmt","SHA1":"","Target":"sds_dev_ado","Vars":{}} -->